Repository: anirac-tech/memverse_project
Catalog: lib/l10n/arb/app_*.arb
Languages: es

source: Reference Test
es: Prueba de Referencias

source: Question
es: Pregunta

source: Reference:
es: Referencia:

# enterReferenceHint
source: Enter reference (e.g., Genesis 1:1)
es: Ingrese referencia (ej., Génesis 1:1)

# referenceFormat
source: Format: Book Chapter:Verse
es: Formato: Libro Capítulo:Versículo

source: Submit
es: Enviar

source: Correct!
es: ¡Correcto!

# pleaseEnterReference
source: Please enter a reference.
es: Por favor ingrese una referencia.

# notQuiteRight
source: That's not quite right. The correct reference is {reference}.
es: No es del todo correcto. La referencia correcta es {reference}.

# correctReferenceIdentification
source: Great job! You correctly identified this verse as {reference}.
es: ¡Buen trabajo! Identificaste correctamente este versículo como {reference}.

# bookAndChapterCorrectButVerseIncorrect
source: You got the book and chapter right, but the verse is incorrect. The correct reference is {reference}.
es: El libro y capítulo son correctos, pero el versículo es incorrecto. La referencia correcta es {reference}.

# bookCorrectButChapterIncorrect
source: You got the book right, but the chapter is incorrect. The correct reference is {reference}.
es: El libro es correcto, pero el capítulo es incorrecto. La referencia correcta es {reference}.

# bookIncorrect
source: The book you entered is incorrect. The correct reference is {reference}.
es: El libro que ingresaste es incorrecto. La referencia correcta es {reference}.

source: Reference Recall
es: Recuerdo de Referencias

source: References Due Today
es: Referencias por Revisar Hoy

source: Prior Questions
es: Preguntas Anteriores

# noPreviousQuestions
source: No previous questions yet
es: Aún no hay preguntas anteriores

source: Reference cannot be empty
es: La referencia no puede estar vacía

source: Invalid book name
es: Nombre de libro inválido

source: Format should be "Book Chapter:Verse"
es: El formato debe ser "Libro Capítulo:Versículo"
